# eval函数是一个功能非常强大的函数

# eval函数可以将str(字符串)转化为list(列表)、dict(字典)、tuple(元组)类型
#  str函数可以把list(列表)、dict(字典)、tuple(元组)转为为str(字符串)类型

# -----字符串转列表------
# a是个字符串类型的量
# 当字符串以"[]"括起来的时候,eval就会将其识别为列表
a = "[[1,2], [3,4], [5,6], [7,8], [9,0]]"
# 将其转化成列表
a_list = eval(a)
print(a_list, "\n", type(a_list))

# -----字符串转字典-----
# b是个字符串类型的量
# 当字符串以"{}"括起来的时候,eval就会将其识别为字典
b = "{1: 'a', 2: 'b'}"
# 将其转化成列表
b_list = eval(b)
print(b_list, "\n", type(b_list))

# -----字符串转-----
# c是个字符串类型的量
# 当字符串以"()"括起来的时候,eval就会将其识别为元组
c = "([1,2], [3,4], [5,6], [7,8], (9,0))"
# 将其转化成列表
c_list = eval(c)
print(c_list, "\n", type(c_list))
